#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_cloudwatch_log_group.current_air_quality: Refreshing state... [id=/aws/lambda/c18-climate-monitor-current-air-quality-lambda]
aws_cloudwatch_log_group.historic_weather: Refreshing state... [id=/aws/lambda/c18-climate-monitor-historic-weather-lambda]
aws_security_group.allow_5432: Refreshing state... [id=sg-00146638977b9f8dc]
aws_ecr_repository.daily_summary: Refreshing state... [id=c18-climate-monitor-daily-summary-ecr]
aws_ecr_repository.flood_warning_check: Refreshing state... [id=c18-climate-monitor-flood-warning-check-ecr]
aws_ecr_repository.current_weather: Refreshing state... [id=c18-climate-monitor-current-weather-ecr]
aws_ecr_repository.future_predictions: Refreshing state... [id=c18-climate-monitor-future-predictions-ecr]
aws_ecr_repository.historic_air_quality: Refreshing state... [id=c18-climate-monitor-historic-air-quality-ecr]
aws_ecr_repository.dashboard: Refreshing state... [id=c18-climate-monitor-dashboard-ecr]
aws_ecr_repository.historic_weather: Refreshing state... [id=c18-climate-monitor-historic-weather-ecr]
aws_cloudwatch_log_group.current_weather: Refreshing state... [id=/aws/lambda/c18-climate-monitor-current-weather-lambda]
aws_ecr_repository.new_location_orchestrator: Refreshing state... [id=c18-climate-monitor-new-location-orchestrator-ecr]
aws_cloudwatch_log_group.historic_air_quality: Refreshing state... [id=/aws/lambda/c18-climate-monitor-historic-air-quality-lambda]
aws_ecr_repository.current_reading_orchestrator: Refreshing state... [id=c18-climate-monitor-current-reading-orchestrator-ecr]
aws_iam_role.lambda: Refreshing state... [id=c18-climate-monitor-lambda-iam]
data.aws_iam_policy_document.example: Reading...
data.aws_iam_policy_document.example: Read complete after 0s [id=1734155287]
aws_ecr_repository.current_air_quality: Refreshing state... [id=c18-climate-monitor-current-air-quality-ecr]
aws_vpc_security_group_ingress_rule.allow_ingress_5432: Refreshing state... [id=sgr-0c0647e7620fc928e]
aws_db_instance.climate: Refreshing state... [id=db-FRWD4BKFF4THTAGHZDARGIT56U]
aws_ecr_repository_policy.example: Refreshing state... [id=c18-climate-monitor-historic-air-quality-ecr]
aws_iam_role_policy_attachment.lambda_basic_exec_role: Refreshing state... [id=c18-climate-monitor-lambda-iam/arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
aws_lambda_function.historic_air_quality: Refreshing state... [id=c18-climate-monitor-historic-air-quality-lambda]
aws_lambda_function.current_air_quality: Refreshing state... [id=c18-climate-monitor-current-air-quality-lambda]
aws_lambda_function.current_weather: Refreshing state... [id=c18-climate-monitor-current-weather-lambda]
aws_lambda_function.historic_weather: Refreshing state... [id=c18-climate-monitor-historic-weather-lambda]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_repository.location_assignment will be created
  + resource "aws_ecr_repository" "location_assignment" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "c18-climate-monitor-location-assignment-ecr"
      + region               = "eu-west-2"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @jamief3105, Action: `pull_request`*